import 'package:flutter/material.dart';
import 'package:google_fonts/google_fonts.dart';

class Pageviewerss extends StatelessWidget {
  const Pageviewerss({super.key});

  @override
  Widget build(BuildContext context) {
    return Scaffold(
     floatingActionButton: FloatingActionButton.large(onPressed: (){
     
       

     },child: Text("Swip Display"),),
   

      body: InteractiveViewer(scaleFactor: 3.3,
        child: PageView(
          scrollDirection: Axis.horizontal,
          children: [
            Container(
              color: Colors.black45,
              child: SingleChildScrollView(
                scrollDirection: Axis.vertical,
                child: Padding(
                  padding: const EdgeInsets.all(8.0),
                  child: Column(
                    mainAxisAlignment: MainAxisAlignment.center,
                    crossAxisAlignment: CrossAxisAlignment.center,
                    children: [
                      Padding(
                        padding: const EdgeInsets.only(top: 20),
                        child: Center(
                            child: Text(
                          "শিব তান্ডব স্তোত্র",
                          style: GoogleFonts.damion(
                              fontSize: 40, color: Colors.green),
                        )),
                      ),
                      const SizedBox(
                        height: 10,
                      ),
                      Center(
                          child: Text(
                        "ভগবান শিবের সবচেয়ে গুরুত্বপূর্ণ স্তোত্রগুলির মধ্যে একটি হল 'শিব তান্ডব স্তোত্র'। বিশ্বাস করা হয় যে, রাজা রাবন ছিলেন শিবের একনিষ্ঠ ভক্ত। শিবের অনুসারীগণ মনে করেন যে, রাবন এই স্তোত্রটি রচনা করেন এবং তিনিই প্রথম এটি পাঠ করেন।\nশিব তান্ডব স্তোত্র সম্পর্কে রামায়ণের চরিত্র রাবণকে ঘিরে একটি বহুল প্রচলিত কাহিনী রয়েছে। কাহিনীটি এরকম যে, রাবনের পূর্বে তাঁর সৎ ভাই কুবের ছিলেন লঙ্কার রাজা। কুবেরের ছিল দূর্লভ এক পুষ্পক বিমান ( উড়ুক্কু রথ)। একসময় রাবন তাঁর ভাইকে যুদ্ধে পরাজিত করে সেই পুষ্পক বিমানে চড়ে বিশ্ব পরিভ্রমণ করছিলেন। এভাবে একসময় তিনি কৈলাস পর্বতের কাছে আসলে তাঁর পুষ্পক বিমান থেমে যায়। হিন্দুধর্মমতে কৈলাস পর্বত ভগবান শিবের আবাসস্থল এবং গোটা পৃথিবীর কেন্দ্রস্থল। সেখানে পুষ্পক বিমান থেমে গেলে রাবণ ভীষণ বিরক্ত হন। কৈলাস পর্বত রাবনকে তাঁর বিমানের দিক পরিবর্তন করতে বলে কারণ সেই মূহুর্তে শিব-পার্বতী কৈলাসে বিশ্রামরত ছিলেন। কিন্তু রাবন কৈলাসের কথায় কর্ণপাত করলেন না। তিনি পুষ্পক বিমান থেকে নেমে কৈলাসকে সরিয়ে দেয়ার জন্য প্রচন্ড শক্তি প্রয়োগ করলেন। এতে গোটা পৃথিবী কাঁপতে শুরু করল।\nসেই মুহূর্তে রাবনকে শিক্ষা দেয়ার জন্য ভগবান শিব তাঁর পায়ের আঙুল দিয়ে কৈলাস পর্বতকে প্রচন্ড শক্তিতে চেপে ধরলেন। পর্বতের চাপে রাবনের হাত পিষে যেতে থাকল। যন্ত্রণায় রাবন চিৎকার করতে লাগলেন। সেই চিৎকার ত্রিলোকের (স্বর্গ, মর্ত্য ও পাতাল) সব যায়গা থেকে শোনা গেলো। সংস্কৃতে এই চিৎকারের ধ্বণিকে বলে 'রব'। সেই রব শুনে মহর্ষি নারদ সেখানে উপস্থিত হলেন। তিনি সেই অবস্থা থেকে পরিত্রাণের জন্য রাবনকে শিবের আরাধনা করতে পরামর্শ দিলেন। মহর্ষি নারদের পরামর্শ অনুযায়ী রাবন চৌদ্দ দিন ধরে শিব মন্ত্র পাঠ করতে থাকলেন। এরপর প্রদোষকালে (সূর্যোদয়ের পূর্বে একঘন্টা ও সূর্যাস্তের পরে একঘন্টার মধ্যের সময়) শিব তান্ডব স্তোত্র পাঠ করতে থাকলেন। যাদুকরী সেই স্তোত্র পাঠ ত্রিভুবনের সব যায়গা থেকে শোনা গেলো। শিবের সৌন্দর্য ও প্রশংসা সংবলিত সেই স্তোত্র শুনে সবাই মুগ্ধ হল। \nস্তোত্র পাঠ শেষ হলে ভগবান শিব রাবনের প্রতি অত্যন্ত সন্তুষ্ট হয়ে কৈলাস থেকে নেমে এলেন এবং তাঁর নাম দিলেন রাবন। এর আগে রাবনকে দশানন (দশ মাথা যার) বলে ডাকা হতো। রাবন ছিলেন সত্যিকারের একজন বেদজ্ঞ এবং দেবী সরস্বতীর আশির্বাদধন্য। যথাযথ সুর ও ছন্দের সমন্বয়ে তৈরি শিব তান্ডব স্তোত্র পাঠ শুনে রাবনের প্রতি ভগবান শিব এতটাই সন্তুষ্ট হলেন যে, তখন তাঁকে তিনি অতি দূর্লভ চন্দ্রহাস তরবারি দান করলেন। \nশিবের অনুসারীগণ বিশ্বাস করেন, শিবের অন্যান্য স্তোত্রের মত শিব তান্ডব স্তোত্রও সবার পাঠ করা উচিত। তাদের মতে, এই স্তোত্রের যাদুকরী ক্ষমতা রয়েছে। তাই আমাদের শারীরিক, মানসিক ও আত্মিক উন্নতিতে এই স্তোত্র সঠিক নিয়মে এবং ভগবান শিবের প্রতি পূর্ণ ভক্তি নিয়ে পাঠ করা উচিত। তাছাড়া এই স্তোত্র পাঠে আমাদের সুখ, সমৃদ্ধি ও শক্তি বৃদ্ধি পায় এবং আমরা আমাদের মধ্যে শিবের উপস্থিতি অনুভব করি। যে কোন সময় শিব তান্ডব স্তোত্র পাঠ ও শ্রবণ করা যায়, তবে প্রদোষকালে এই স্তোত্র পাঠ করাই উত্তম। ",
                        style: GoogleFonts.abel(
                          fontSize: 15,
                        ),
                      )),
                      Center(
                          child: Text(
                        "শিবের বিভিন্ন নাম\nশিবকে বিভিন্ন নামে ডাকা হয়ে থাকে। অন্য সকল দেবতার মত তারও ১০৮ নাম রয়েছে। এর মধ্যে অন্যতম হল - মহাদেব, শিব, নটরাজ, শম্ভু, পশুপতি, নীলকণ্ঠ, চিন্তামণি, মহেশ্বর, রুদ্র, গৌরিপতি, মাতাঙ্গেশ্বর, মহাশম্বরানন্দ ভৈরব, রাক্ষসেশ্বর, ভীমেশ্বর, শৈলেন্দ্রেশ্বর, কোটেশ্বর মহাদেব, কালভৌরব, জগন্নাথদেব, মল্লিকার্জুন, অ্যাকাম্রনাথ, সিদ্ধিনাথ, বাল্ব্রক্ষেশ্বর, লম্বকর্ণ, চামুণ্ডেশ্বর, মহাকাল, ভুবনেশ্বর, বগলামুখেশ্বর, সতীপতি, ত্রিপুরারি, তীর্থরাজ, সদাশিব, যোগীশ্বর ইত্যাদি।[তথ্যসূত্র প্রয়োজন]\nশিবের পুত্র  \nহিন্দু মাত্রেই জানেন শিবের পুত্রের সংখ্যা দুই। কার্তিক বা ষড়ানন আর গণেশ বা গজানন। কিন্তু, ‘শিবপুরাণ’ জানাচ্ছে, শিবের মোট পুত্রসংখ্যা ৬। এই পুত্রেরা কেউই কিন্তু পার্বতীর সন্তান নন। শিবের বিভিন্ন লীলার সময়ে তাদের জন্ম হয়েছিল। কার্তিক-গণেশ ছাড়াও বাকি চার পুত্রের সন্ধান রইল এখানে। \nআয়াপ্পান— অসুরদের হাত থেকে অমৃতকে বাঁচানোর জন্য বিষ্ণু মোহিনীরূপ ধারণ করেন। শিব মোহিনীর সৌন্দর্যে বশীভূত, মনোমুগ্ধকর ও মোহিত হন। মোহিনীর সাথে মিলিত হওয়ার চেষ্টা করেন। কিন্তু তার আগেই তার বীর্য স্খলন হয়ে মাটিতে পরে। সেখান থেকেই আয়াপ্পানের জন্ম হয়। দক্ষিণ ভারতে আইপ্পানকে গুরুত্বপূর্ণ দেবতা বলেই মনে করা হয়। তাকে হরি ও হরের সম্মিলিত রূপ বলে মনে করা হয়। \nঅন্ধকাসুর— দানবরাজ হিরণ্যাক্ষ পুত্রহীন ছিলেন। তিনি পুত্রলাভের আশায় মহাদেবের তপস্যা করেন। শিব তাকে এক পুত্রসন্তান প্রদান করেন। জন্মান্ধ সেই পুত্রের নাম ছিল অন্ধকাসুর। পরে অন্ধকাসুর পার্বতীকে অনৈতিকভাবে অধিকার করতে চাইলে স্বয়ং শিবই তাকে হত্যা করেন। \nভৌম— শিবের স্বেদবিন্দু ভূমিতে পড়েই ভৌমের জন্ম হয়েছিল। শিব তখন গভীর ধ্যানে মগ্ন ছিলেন। ভূমিদেবীই ভৌমকে পালন করেন। পরে শিব ভৌমের কথা জানতে পারেন এবং তাকে পুত্র হিসেবে স্বীকার করে নেন। \nখুজ— একবার গভীর ধ্যানে মগ্ন অবস্থায় শিবের দেহ থেকে তীব্র জ্যোতি বিকীর্ণ হতে থাকে। সেই জ্যোতি ভূমিতে প্রবিষ্ট হলে খুজের জন্ম হয়। তাকে লৌহের দেবতা বলে মনে করা হয়। ",
                        style: GoogleFonts.abel(
                          color: Colors.teal,
                          fontSize: 15,
                        ),
                      )),
                    ],
                  ),
                ),
              ),
            ),
            Container(
              decoration: const BoxDecoration(
                  image: DecorationImage(
                      image: AssetImage("assets/images/shiva1.jpg"),
                      fit: BoxFit.cover)),
            ),
            Container(
              decoration: const BoxDecoration(
                  image: DecorationImage(
                      image: AssetImage("assets/images/shiva2.jpg"),
                      fit: BoxFit.fitWidth)),
            ),
            Container(
              decoration: const BoxDecoration(
                  image: DecorationImage(
                      image: AssetImage("assets/images/shiva3.jpg"),
                      fit: BoxFit.cover)),
            ),
          ],
        ),
      ),
    );
  }
}
